netify-soap/src/test/resources/soap/requests/movie/GetMovieAllRequestFilterTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general"
                  xmlns:mov="http://mouthaan.org/namespace/netify/datatypes/movie">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetMovieAllRequest>
            <!--Optional:-->
            <gen:filters>
                <!--Optional:-->
                <mov:title>Unforgiven</mov:title>
            </gen:filters>
        </gen:GetMovieAllRequest>
    </soapenv:Body>
</soapenv:Envelope>